MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF144/mcu.h
extern volatile __U3MODEbits_t U3MODEbits __asm__ ("U3MODE") __attribute__((section("sfrs"), address(0xBF822400)));
#define UEFMODE UEFMODE
extern volatile uint32_t   UEFMODE __attribute__((section("sfrs"), address(0xBF822400)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __UEFMODEbits_t;
extern volatile __UEFMODEbits_t UEFMODEbits __asm__ ("UEFMODE") __attribute__((section("sfrs"), address(0xBF822400)));
extern volatile uint32_t        U3MODECLR __attribute__((section("sfrs"),address(0xBF822404)));
extern volatile uint32_t        UEFMODECLR __attribute__((section("sfrs"),address(0xBF822404)));
extern volatile uint32_t        U3MODESET __attribute__((section("sfrs"),address(0xBF822408)));
extern volatile uint32_t        UEFMODESET __attribute__((section("sfrs"),address(0xBF822408)));
extern volatile uint32_t        U3MODEINV __attribute__((section("sfrs"),address(0xBF82240C)));
extern volatile uint32_t        UEFMODEINV __attribute__((section("sfrs"),address(0xBF82240C)));
#define U3STA U3STA
extern volatile uint32_t   U3STA __attribute__((section("sfrs"), address(0xBF822410)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U3STAbits_t;
extern volatile __U3STAbits_t U3STAbits __asm__ ("U3STA") __attribute__((section("sfrs"), address(0xBF822410)));
#define UEFSTA UEFSTA
extern volatile uint32_t   UEFSTA __attribute__((section("sfrs"), address(0xBF822410)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __UEFSTAbits_t;
extern volatile __UEFSTAbits_t UEFSTAbits __asm__ ("UEFSTA") __attribute__((section("sfrs"), address(0xBF822410)));
extern volatile uint32_t        U3STACLR __attribute__((section("sfrs"),address(0xBF822414)));
extern volatile uint32_t        UEFSTACLR __attribute__((section("sfrs"),address(0xBF822414)));
extern volatile uint32_t        U3STASET __attribute__((section("sfrs"),address(0xBF822418)));
extern volatile uint32_t        UEFSTASET __attribute__((section("sfrs"),address(0xBF822418)));
extern volatile uint32_t        U3STAINV __attribute__((section("sfrs"),address(0xBF82241C)));
extern volatile uint32_t        UEFSTAINV __attribute__((section("sfrs"),address(0xBF82241C)));
#define U3TXREG U3TXREG
extern volatile uint32_t   U3TXREG __attribute__((section("sfrs"), address(0xBF822420)));
#define UEFTXREG UEFTXREG
extern volatile uint32_t   UEFTXREG __attribute__((section("sfrs"), address(0xBF822420)));
#define U3RXREG U3RXREG
extern volatile uint32_t   U3RXREG __attribute__((section("sfrs"), address(0xBF822430)));
#define UEFRXREG UEFRXREG
extern volatile uint32_t   UEFRXREG __attribute__((section("sfrs"), address(0xBF822430)));
#define U3BRG U3BRG
extern volatile uint32_t   U3BRG __attribute__((section("sfrs"), address(0xBF822440)));
#define UEFBRG UEFBRG
extern volatile uint32_t   UEFBRG __attribute__((section("sfrs"), address(0xBF822440)));
extern volatile uint32_t        U3BRGCLR __attribute__((section("sfrs"),address(0xBF822444)));
extern volatile uint32_t        UEFBRGCLR __attribute__((section("sfrs"),address(0xBF822444)));
extern volatile uint32_t        U3BRGSET __attribute__((section("sfrs"),address(0xBF822448)));
extern volatile uint32_t        UEFBRGSET __attribute__((section("sfrs"),address(0xBF822448)));
extern volatile uint32_t        U3BRGINV __attribute__((section("sfrs"),address(0xBF82244C)));
extern volatile uint32_t        UEFBRGINV __attribute__((section("sfrs"),address(0xBF82244C)));
#define U4MODE U4MODE
extern volatile uint32_t   U4MODE __attribute__((section("sfrs"), address(0xBF822600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U4MODEbits_t;
extern volatile __U4MODEbits_t U4MODEbits __asm__ ("U4MODE") __attribute__((section("sfrs"), address(0xBF822600)));
#define UGHMODE UGHMODE
extern volatile uint32_t   UGHMODE __attribute__((section("sfrs"), address(0xBF822600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __UGHMODEbits_t;
extern volatile __UGHMODEbits_t UGHMODEbits __asm__ ("UGHMODE") __attribute__((section("sfrs"), address(0xBF822600)));
extern volatile uint32_t        U4MODECLR __attribute__((section("sfrs"),address(0xBF822604)));
extern volatile uint32_t        UGHMODECLR __attribute__((section("sfrs"),address(0xBF822604)));
extern volatile uint32_t        U4MODESET __attribute__((section("sfrs"),address(0xBF822608)));
extern volatile uint32_t        UGHMODESET __attribute__((section("sfrs"),address(0xBF822608)));
extern volatile uint32_t        U4MODEINV __attribute__((section("sfrs"),address(0xBF82260C)));
extern volatile uint32_t        UGHMODEINV __attribute__((section("sfrs"),address(0xBF82260C)));
#define U4STA U4STA
extern volatile uint32_t   U4STA __attribute__((section("sfrs"), address(0xBF822610)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U4STAbits_t;
extern volatile __U4STAbits_t U4STAbits __asm__ ("U4STA") __attribute__((section("sfrs"), address(0xBF822610)));
#define UGHSTA UGHSTA
extern volatile uint32_t   UGHSTA __attribute__((section("sfrs"), address(0xBF822610)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __UGHSTAbits_t;
